app/Controllers/Sidebar.php

    public function widget()
    {
        $artikelModel = new ArtikelModel();
        $kategoriModel = new KategoriModel();

        $data = [
            'artikel_terkini' => $artikelModel->orderBy('id', 'DESC')->limit(5)->find(),
            'kategori'        => $kategoriModel->findAll()
        ];
---
SELECT *
FROM `artikel`
ORDER BY `id` DESC
 LIMIT 5
SELECT *
FROM `kategori`